**free
/if not defined(COPYRIGHT_DSPEC)
ctl-opt copyright('V1.4 - 06.06.2026 - mailto: thomas.raddatz@tools400.de');
/eof
/endif
dcl-c DSPSRC_VERSION '1.4';
dcl-c DSPSRC_DATE '06.06.2026';
