      /if not defined(COPYRIGHT_DSPEC)
     H COPYRIGHT('V1.3.1 - 08.02.2019 - mailto: thomas.raddatz@tools400.de')
      /eof
      /endif
     D DSPSRC_VERSION...
     D                 C                   '1.3.1'
     D DSPSRC_DATE...
     D                 C                   '08.02.2019'
