/* =================================================================== */
/*                                                                     */
/*  Kurzdokumentation :                                                */
/*                                                                     */
/*  Bereich . . . : DSPSRC                                             */
/*  Objekt  . . . : DSPSRCC                                            */
/*  Beschreibung  : Tool: DSPSRC     (Display Source Code)             */
/*  Author  . . . : Thomas Raddatz   <thomas.raddatz@tools400.de>      */
/*  Datum . . . . : 25.07.2001                                         */
/*                                                                     */
/* =================================================================== */
/*                                                                     */
/*  This software is free software, you can redistribute it and/or     */
/*  modify it under the terms of the GNU General Public License (GPL)  */
/*  as published by the Free Software Foundation.                      */
/*                                                                     */
/*  See GNU General Public License for details.                        */
/*          http://www.opensource.org                                  */
/*          http://www.opensource.org/licenses/gpl-license.html        */
/*                                                                     */
/* =================================================================== */
/*  History:                                                           */
/*                                                                     */
/*  Datum       Name          Änderung                                 */
/*  ----------  ------------  ---------------------------------------  */
/*                                                                     */
/* =================================================================== */
/* >>PRE-COMPILER<<                                                    */
/*   >>CRTCMD<< CRTCLMOD     MODULE(&LI/&OB) +                         */
/*                           SRCFILE(&SL/&SF) +                        */
/*                           SRCMBR(&SM);                              */
/*   >>IMPORTANT<<                                                     */
/*     >>PARM<< DBGVIEW(*LIST);                                        */
/*     >>PARM<< OPTION(*EVENTF);                                       */
/*   >>END-IMPORTANT<<                                                 */
/*   >>EXECUTE<<                                                       */
/*   >>CMD<<    CRTPGM       PGM(&LI/DSPSRCC   )  +                    */
/*                           MODULE(&LI/DSPSRCR1  +                    */
/*                                  &LI/DSPSRCR2  +                    */
/*                                  &LI/DSPSRCR3) +                    */
/*                           ENTMOD(&LI/DSPSRCC)  +                    */
/*                           ACTGRP(*NEW) +                            */
/*                           DETAIL(*BASIC);                           */
/* >>END-PRE-COMPILER<<                                                */
/* =================================================================== */
/*                                                                     */
/*  Bei einer Erweiterung des Parameters OBJTYPE, bitte auch im        */
/*  CL-Programm die Variable &TYPAVAIL entsprechend ändern.            */
/*  Max. sind 10 Typen möglich. Danach muß die auch die Länge          */
/*  von &TYPAVAIL sowie die Abfrage auf 100 geändert werden.           */
/*                                                                     */
/* =================================================================== */
             PGM        PARM(&OBNMLB  +
                             &OBJTYPE +
                             &AUTOSLC )

             DCL        VAR(&OBNMLB  ) TYPE(*CHAR) LEN(20)
             DCL        VAR(&OBJTYPE ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&AUTOSLC ) TYPE(*CHAR) LEN( 1)

             DCL        VAR(&PGMI0100  ) TYPE(*CHAR) LEN(161)
             DCL        VAR(&PGMILEN   ) TYPE(*CHAR) LEN(  4)
             DCL        VAR(&PGMIFMT   ) TYPE(*CHAR) LEN(  8)
             DCL        VAR(&PGMINAME  ) TYPE(*CHAR) LEN( 20)
             DCL        VAR(&PGMIPGMTYP) TYPE(*CHAR) LEN(  1)
             DCL        VAR(&APIERROR  ) TYPE(*CHAR) LEN(  8)

             DCL        VAR(&OBNM    ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&OBLB    ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&QSRC    ) TYPE(*CHAR) LEN(20)
             DCL        VAR(&SRCF    ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SRCL    ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SRCM    ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&RCD     ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&STRPOS  ) TYPE(*DEC ) LEN(5 0)
             DCL        VAR(&LENAVAIL) TYPE(*DEC ) LEN(5 0) +
                        VALUE(100)
             DCL        VAR(&TYPAVAIL) TYPE(*CHAR) LEN(100) +
                        VALUE('*CMD      +
                               *FILE     +
                               *MODULE   +
                               *PGM      +
                               *SRVPGM   +
                               *TBL      ')

/* Fehlerbehandlung     */
             DCL        VAR(&ERROR)      TYPE(*LGL) +
                          VALUE('0')
             DCL        VAR(&TRUE)       TYPE(*LGL) +
                          VALUE('1')
             DCL        VAR(&FALSE)      TYPE(*LGL) +
                          VALUE('0')
             DCL        VAR(&ERRMSGKEY)  TYPE(*CHAR) LEN(4)

             DCL        VAR(&ERRMSGTYP)  TYPE(*CHAR) LEN(10) +
                          VALUE('*DIAG')
             DCL        VAR(&ERRNBRTYP)  TYPE(*CHAR) LEN(4) +
                          VALUE(X'00000001')
             DCL        VAR(&ERRPGMMSGQ) TYPE(*CHAR) LEN(10) +
                          VALUE('*CTLBDY')
             DCL        VAR(&ERRSTKCTR)  TYPE(*CHAR) LEN(4) +
                          VALUE(X'00000001')
             DCL        VAR(&ERRCODE  )  TYPE(*CHAR) LEN(4) +
                          VALUE(X'00000000')

/* Sende alle Fehler zur Error Handling Routine */
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ERROR))

             CHGVAR     VAR(&ERROR    ) VALUE(&FALSE)

 /* -------------------------------------------------------------- */
 /*  Los geht's                                                    */
 /* -------------------------------------------------------------- */

             CHGVAR     VAR(&OBNM) VALUE(%SST(&OBNMLB 1 10))
             CHGVAR     VAR(&OBLB) VALUE(%SST(&OBNMLB 11 10))

 /* Objekttyp ist *SERACH     */
             IF         COND(&OBJTYPE *EQ '*SEARCH') THEN(DO)
              CHGVAR     VAR(&STRPOS) VALUE(1)
 SearchLoop:
              CHGVAR     VAR(&OBJTYPE) +
                         VALUE(%SST(&TYPAVAIL &STRPOS 10))
              CHKOBJ     OBJ(&OBLB/&OBNM) OBJTYPE(&OBJTYPE)
              MONMSG     MSGID(CPF0000) EXEC(DO)
               CHGVAR     VAR(&STRPOS) VALUE(&STRPOS +10)
               IF         COND(&STRPOS *LE &LENAVAIL) THEN(DO)
                GOTO       CMDLBL(SearchLoop)
               ENDDO
               ELSE       CMD(DO)
                CHGVAR     VAR(&OBJTYPE) VALUE('*SEARCH')
                SNDPGMMSG  MSGID(CPF9897) MSGF(*LIBL/QCPFMSG) +
                           MSGDTA('Object' *BCAT &OBNM *BCAT 'of type' +
                           *BCAT &OBJTYPE *BCAT 'not found.') TOPGMQ(*PRV +
                           (*)) MSGTYPE(*ESCAPE)
               ENDDO
              ENDDO

             ENDDO
             ELSE       CMD(DO)
 /* Objekttyp wurde angegeben */
              CHKOBJ     OBJ(&OBLB/&OBNM) OBJTYPE(&OBJTYPE)
              MONMSG     MSGID(CPF0000) EXEC(DO)
               SNDPGMMSG  MSGID(CPF9897) MSGF(*LIBL/QCPFMSG) +
                          MSGDTA('Object' *BCAT &OBNM *BCAT 'of type' +
                          *BCAT &OBJTYPE *BCAT 'not found.') TOPGMQ(*PRV +
                          (*)) MSGTYPE(*ESCAPE)
              ENDDO
             ENDDO

             RTVOBJD    OBJ(&OBLB/&OBNM) OBJTYPE(&OBJTYPE) +
                          SRCF(&SRCF) +
                          SRCFLIB(&SRCL) SRCMBR(&SRCM)

             CHGVAR     VAR(&PGMIPGMTYP) VALUE(' ')

             IF         COND(&OBJTYPE *EQ '*PGM') THEN(DO)
               CHGVAR     VAR(&PGMI0100)           VALUE(' ')
               CHGVAR     VAR(%BIN(&PGMILEN 1 4))  VALUE(161)
               CHGVAR     VAR(&PGMIFMT )           VALUE('PGMI0100')
               CHGVAR     VAR(&PGMINAME)           VALUE(&OBNM *CAT &OBLB)
               CHGVAR     VAR(%BIN(&APIERROR 1 4)) VALUE(  0)
               CHGVAR     VAR(%BIN(&APIERROR 5 4)) VALUE(  0)

               CALL       PGM(QCLRPGMI) PARM(&PGMI0100 +
                                             &PGMILEN  +
                                             &PGMIFMT  +
                                             &PGMINAME +
                                             &APIERROR )

               /* ------------------------------------- */
               /*  Type of program:                     */
               /*    " " - OPM program                  */
               /*    "B" - ILE program                  */
               /* ------------------------------------- */
               CHGVAR     VAR(&PGMIPGMTYP) VALUE(%SST(&PGMI0100 161 1))
             ENDDO

             IF         COND(&OBJTYPE *EQ '*SRVPGM') THEN(DO)
               CHGVAR     VAR(&PGMIPGMTYP) VALUE('B')
             ENDDO

             IF         COND(&PGMIPGMTYP *EQ 'B') THEN(DO)
              CALLPRC    PRC(DSPSRCR2) PARM(&OBNMLB  +
                                            &OBJTYPE +
                                            &AUTOSLC +
                                            &QSRC    +
                                            &SRCM    +
                                            &RCD)
              IF         COND(&RCD *EQ ' ') THEN(DO)
               CHGVAR     VAR(&SRCF) VALUE(%SST(&QSRC   1 10))
               CHGVAR     VAR(&SRCL) VALUE(%SST(&QSRC   11 10))
              ENDDO
              ELSE       CMD(DO)
               /* Abbruch durch Benutzer */
               GOTO       CMDLBL(ENDE)
              ENDDO
             ENDDO

             CHKOBJ     OBJ(&SRCL/&SRCF) OBJTYPE(*FILE) MBR(&SRCM) +
                          AUT(*USE)
             MONMSG     MSGID(CPF0000) EXEC(DO)
              SNDPGMMSG  MSG('Quellenteildatei' *BCAT &SRCM *TCAT ', +
                         Datei' *BCAT &SRCF *TCAT ', Bibliothek' +
                         *BCAT &SRCL *BCAT 'nicht gefunden.')
              GOTO       CMDLBL(ENDE)
             ENDDO

             STRSEU     SRCFILE(&SRCL/&SRCF) SRCMBR(&SRCM) OPTION(5)

 /* -------------------------------------------------------------- */
 /*  Programm beenden                                              */
 /* -------------------------------------------------------------- */

ENDE:
             DLTOVR     FILE(*ALL)
             MONMSG     MSGID(CPF0000)

             RCLRSC     LVL(*)

/* -------------------------------------------------------------- */
/*    Fehler aufgetreten ?                                        */
/* -------------------------------------------------------------- */

             IF         COND(&ERROR) THEN(DO)
               /* Sende letzte *ESCAPE nochmals   */
               CALL       PGM(QMHRSNEM) PARM(&ERRMSGKEY &ERRCODE)
               MONMSG     MSGID(CPF0000)
             ENDDO

             RETURN

/* ---------------- */
/* Nachrichten      */
/* weiterreichen    */
/* ---------------- */

 ERROR:
             IF         COND(&ERROR) THEN(GOTO CMDLBL(ENDE))
             ELSE       CHGVAR     VAR(&ERROR) VALUE(&TRUE)

/* Verschiebe alle *DIAG Nachrichten zur             */
/* vorangegangenen Programmwarteschlange             */
             CALL       PGM(QMHMOVPM) PARM(&ERRMSGKEY &ERRMSGTYP +
                          &ERRNBRTYP &ERRPGMMSGQ &ERRSTKCTR &ERRCODE)

             GOTO       CMDLBL(ENDE)

             ENDPGM

