      *
      *  ... Execute Command (QCMDEXC) API
     d QCMDEXC...
     d                 pr                  extpgm('QCMDEXC')
     d  i_cmd                     32702A   const  options(*varsize)
     d  i_length                     15P 5 const
     d  i_IGCprcCtrl                  3a   const  options(*nopass)
      *
     d QCMDEXC_IGC     c                   'IGC'
      *
